perf/sync.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp - 1
      duration: 10
      arrivalRate: 2
      rampTo: 10
    - name: Plain - 1
      duration: 50
      arrivalRate: 6


scenarios:
  - name: sync
    flow:
      - get:
          url: '/sync-proxy'